## "Бесконечный ввод и подсчет положительных"

### Задание

С клавиатуры вводятся целые числа, до тех пор пока не будет введена строка "стоп". \
Посчитайте количество положительных чисел, среди введенных.

### Формат входных данных

Вводятся целые числа, пока не будет введено "стоп".

### Формат выходных данных

Вывести количество положительных.

### Решение задачи

needed_value = "stop"
print("Для окончания программы введите", needed_value)
x = ""
count = 0

while needed_value != x:
    input_value = input("value: ") and x > 0
    #if int(x) > 0:
    count += 1
    print("Вы ввели число:", x)
    print(count)

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотри пример "Выполнение цикла пока не будет введено нужное значение"
</details>
